<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ca27d673511141e2ed6a0d691bf256bd1d21585867cfab8f56b627712e254244","plan_job_ref":"Job Staging Image Build & Push #47 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439355902","plan_hash":"c42b730b541b57ce5a911e8f1cb760beae2d369473fba1c72f2abdcaa3152383","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
        name                             = "fastapi-ASG-dev"
#        (26 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:38" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:38" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:093209d8383eccc983e5bc2354b3e6419ad869a0" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:f108d505dc8b9a6736c338aa323946e28659b955"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 38 -> (known after apply)
-       tags                     = {} -> null
#        (4 unchanged attributes hidden)
    }

  # aws_launch_template.ASG_template will be updated in-place
!~  resource "aws_launch_template" "ASG_template" {
        id                      = "lt-039233a2ff72949a2"
!~      latest_version          = 1 -> (known after apply)
        name                    = "LaunchTemplateECR20240107155024896300000001"
        tags                    = {}
+       user_data               = "IyEvYmluL2Jhc2gKZWNobyAiRUNTX0NMVVNURVI9ZmFzdGFwaS1jbHVzdGVyIiA+PiAvZXRjL2Vjcy9lY3MuY29uZmln"
#        (10 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #47](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439355902)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>